Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེ་དག་དད་པ་ཐོབ་མ་ཐག་ཏུ་ཀླུའི་སྐྱེ་གནས་དེ་ནས་ཤི་སྟེ། བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: As soon as they had gained trust in the Buddha, they passed away from their nāga existence and were reborn in the higher realms.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུ་བྱེ་བ་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དེ་དག་བཏུལ་ནས་བསོད་སྙོམས་བཞེས་ཏེ་བར་སྣང་ལ་གཤེགས་སོ། །
en: As the Buddha had now tamed an infinite number of quintillions of nāgas, he partook of the meal offerings and flew again into the sky.

source: དེའི་ཚེ་ན་ཡུལ་ལག་མཐིལ་ལྟར་མཉམ་པ་ན་དཀའ་ཐུབ་ཅན་མེས་བྱིན་ཞེས་བྱ་བ་ཞིག་གནས་ཏེ།
en: At that point in the area of Samapāṇi­tala­jāta there lived an ascetic called Agnidatta,

source: བཅོམ་ལྡན་འདས་ནམ་མཁའི་བར་སྣང་ལས་གཤེགས་པ་མཐོང་ངོ་། །
en: who witnessed the Blessed One flying through the sky.

source: དེ་མཐོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་གུས་པ་བསྐྱེད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Seeing this, he felt strong devotion to the Blessed One and called out to him,

source: བཅོམ་ལྡན་འདས་བདག་ལ་མཚན་མའི་རྣམ་པ་དེ་བཞིན་དུ་མཛད་དུ་གསོལ།
en: “Blessed One, please grant me that ability!

source: གང་བདག་གི་གནས་འདིར་བཞུགས་ན་མཆོད་པར་བགྱིའོ། །
en: If you come to stay here with me, I will worship you!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་རལ་པ་ཅན་མེས་བྱིན་གྱི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས།
en: The Blessed One knew the thoughts of the ascetic Agnidatta and,

source: སྐྱེ་བོ་ཕྱི་མ་དག་ཉིད་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་རྡོ་ལེབ་ལ་ཞབས་བཞག་གོ། །
en: out of love for beings of the future, he put down his feet on a flat rock.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རལ་པ་ཅན་མེས་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Then the Blessed One said to the ascetic Agnidatta,

source: བྲམ་ཟེ་ཁྱོད་ཀྱི་སེམས་དད་པར་བྱ་བའི་དོན་དུ་འདི་ནི་མཆོད་རྟེན་ནོ། །
en: “Priest, in order that you develop a trusting mind, this is a support for your worship.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One said to Mahā­maudgalyāyana,

source: མཽད་གལ་གྱི་བུ་ཚུར་ཤོག །
en: “Maudgalyāyana, come!

source: མ་དྲོས་པའི་མཚོ་ག་ལ་བ་དེར་འདོང་ངོ་།
en: We must go to the ocean where Anavatapta resides.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ནས། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས།
en: “Certainly, Blessed One,” Mahā­maudgalyāyana replied, thus obeying the request of the Blessed One.

source: ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་གནས་ཀྱི་ཆུ་འགྲམ་དུ་བཞུགས་སོ། །
en: They proceeded to the shores of the ocean where the nāga king Anavatapta resided.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་གཤེགས་པར་རིག་ནས།
en: When the nāga king Anavatapta realized that the Blessed One had arrived together with his community of hearers,

source: གསེར་དང་། དངུལ་དང་། བཻདཱུ་རྱ་དང་། ཤེལ་དང་། མུ་ཏིག་དམར་པོ་དང་། སྤུག་གི་སྙིང་པོ་དང་། རྡོའི་སྙིང་པོ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་སྟན་ལྔ་བརྒྱ་ཙམ་ཞིག་མངོན་པར་སྤྲུལ་ཏོ། །
en: he manifested five hundred seats made of the seven precious substances: gold, silver, beryl, crystal, red pearls, coral, and emeralds.

source: ཁྲི་སྟན་ལྔ་བརྒྱ་དེ་དག་གི་དབུས་སུ་བཅོམ་ལྡན་འདས་ཀྱི་གདན་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་གདན་བཤམས་ཏེ།
en: At the center of these five hundred seats he arranged a seat for the Blessed One made of the seven precious substances and

source: ཀླུའི་རས་བཅོས་བུས་གཡོགས་སོ། །
en: covered it in a fine cloth of the nāgas.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ཀླུའི་བུ་མོའི་འཁོར་དང་བཅས་པ་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་སོང་ངོ་། །
en: The nāga king Anavatapta, together with a retinue of nāga maidens, then went before the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཟན་ཟོས་ཤིང་ལྷུང་བཟེད་དང་ལག་པ་བཀྲུས་པར་ཐུགས་སུ་ཆུད་ནས་བཀའ་སྩལ་པ།
en: When the Blessed One knew that Mahā­maudgalyāyana had finished his meal and washed his alms bowl and hands, he said to him,

source: མཽད་གལ་གྱི་བུ་སོང་ལ་གནས་བརྟན་ཤཱ་རིའི་བུ་ཁྱོད་ལ་སྟོན་པ་འབོད་དོ་ཞེས་སྨྲོས་ཤིག །
en: “Maudgalyāyana, please go and tell the elder Śāriputra that the teacher is asking for him.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ནས།
en: “Yes, Blessed One,” replied venerable Mahā­maudgalyāyana, and he did as the Blessed One had instructed.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་སྟོབས་དང་ལྡན་པའི་ལག་པ་བསྐུམ་པ་རྐྱོང་བའམ། བརྐྱང་བ་སྐུམ་པ་དེ་བཞིན་དུ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་མ་དྲོས་པའི་མཚོ་ནས་བྱུང་སྟེ།
en: As fast as a strong man can stretch out or bend his arm, venerable Mahā­maudgalyāyana left Anavatapta’s ocean and

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ན་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་མདུན་ན་འདུག་གོ། །
en: arrived back at the grove of Prince Jeta, right in front of venerable Śāriputra,

source: དེའི་ཚེ་ན་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྣམ་སྦྱར་འདྲུབ་པར་གྱུར་ཏོ། །
en: who was busy stitching his outer robe.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་ལྷན་ཅིག་ཏུ་ཡང་དག་པར་དགའ་བའི་གཏམ་དང་གཏམ་སྙན་པ་རྣམ་པ་མང་པོ་བྱས་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The two of them first paid various compliments to each other before venerable Mahā­maudgalyāyana said,

source: སྟོན་པ་ནི་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཁྱོད་ལ་འབོད་དེ།
en: “Venerable Śāriputra, our teacher is calling for you.

source: སྟོན་པ་ཁྱོད་ལ་མངོན་པར་དགྱེས་ཀྱིས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཚུར་ཤོག །
en: Since our teacher is fond of you, you must come with me.

source: སྟོན་པ་ཁྱོད་ལ་གསུང་གིས་འདོང་ངོ་། །
en: Our teacher is asking you to go.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་རེ་ཤིག་སྣམ་སྦྱར་འདི་འཚེམ་མོ། །
en: In reply, venerable Śāriputra said, “Venerable Mahā­maudgalyāyana, I should first finish sewing my robe.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་སོར་མོ་ལྔ་ཁབ་ལྔར་མངོན་པར་སྤྲུལ་ནས་སྣམ་སྦྱར་དེ་བཙེམས་སོ། །
en: Venerable Mahā­maudgalyāyana now transformed five of his fingers into needles and began stitching.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་འདི་ཅི་བྱེད་སྨྲས་པ།
en: “Venerable Maudgalyāyana, why are you doing that?” asked venerable Śāriputra.

source: སྣམ་སྦྱར་བཙེམ་པར་བྱ་བ་འདི་མྱུར་དུ་བཙེམ་པར་བྱའོ། །
en: “We have to stitch your robe quickly!”

source: སྨྲས་པ། དྲུབ་པ་དང་ཟིན་པ་ཉིད་དུ་གྱིས་ཤིག །
en: “Very well, then finish the stitching.”

source: དེ་མ་ཐག་ཏུ་དྲུབས་ཤིང་ཟིན་པ་ཉིད་དུ་བྱས་ནས།
en: So venerable Mahā­maudgalyāyana immediately completed the stitching and

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ཚུར་ཤོག་ད་འདོང་།
en: insisted, “Venerable Śāriputra, come on then, we are leaving now!”

source: སྨྲས་པ། མི་འགྲོའོ། །
en: “But I am not leaving.”

source: སྨྲས་པ། གལ་ཏེ་ཁྱེད་མི་འགྲོ་ན་སྟོབས་ཀྱིས་བཀུར་རོ། །
en: “If you do not come, I will carry you with my strength.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་རེ་ཤིག་སྐ་རགས་འདི་སྟོབས་ཀྱིས་ཁྱེར་ནུས་དང་ང་སྟོབས་ཀྱིས་ཁྱེར་བར་ཤེས་སོ། །
en: “Venerable Mahā­maudgalyāyana, as soon as you can lift this belt with your strength I will know that you can also carry me.”

source: དེས་སྐ་རགས་དེ་འཇིག་རྟེན་གྱི་ཁམས་བདུན་དུ་བྱིན་གྱིས་བརླབས་སོ། །
en: In the meantime, venerable Śāriputra had transformed his belt to weigh as much as seven worlds.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་སྐ་རགས་དེ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་བཏེག་པ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་གཡོས་ཀྱང་སྐ་རགས་དེ་གདེག་པར་མ་ནུས་སོ། །
en: So when venerable Mahā­maudgalyāyana attempted to lift the belt by means of his magical powers , the entire trichiliocosm trembled, yet he was unable to lift the belt.

source: དེ་ནས་མ་དྲོས་པའི་མཚོ་རླབས་ཤིན་ཏུ་གཡོས་སོ། །
en: At that point many waves appeared on Anavatapta’s ocean,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: which caused venerable Aśvajit to ask the Blessed One,

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་དོག་ས་ཆེན་པོ་གཡོས་པ་བྱུང་བ་འདི་རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས།
en: “Blessed One, what is causing this great earthquake?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་རྟ་ཐུལ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to venerable Aśvajit,

source: ཉན་ཐོས་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པའོ། །
en: “It is a manifestation caused by the great hearers.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Venerable Śāriputra then said to venerable Mahā­maudgalyāyana,

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཇེ་བཞུད་ཅིག །
en: “Venerable Mahā­maudgalyāyana, just go ahead!

source: བདག་ཀྱང་མཆིའོ། །
en: I will come as well.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སོང་ནས་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: When venerable Śāriputra arrived before the Blessed One, he prostrated to the Blessed One’s feet and took a seat.

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ནི་ཕྱི་ནས་འོང་ངོ་། །
en: Venerable Mahā­maudgalyāyana arrived later,

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་མངོན་དུ་ཕྱོགས་པའི་རྫུ་འཕྲུལ་ཐོབ་པས་དེ་དང་པོར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་སོང་ནས་འདུག་གོ། །
en: since venerable Śāriputra had attained miraculous abilities related to travel and therefore was the first to arrive before the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མཚན་མ་དེ་ལྟ་བུ་བྱུང་བ་མཛད་པའི་མཚན་མ་ཇི་ལྟ་བུ་བྱུང་བ་མཛད་པས་རྒྱ་མཚོའི་ཀླུའི་རྒྱལ་པོ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Then, since the Blessed One had caused all this to happen, the nāga kings of the ocean had come to see the Blessed One, and were now also in attendance.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་མཛེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At this point the nāga king Sundarānanda said to the Blessed One,

source: གལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: “If the Blessed One would grant me the opportunity, I have something to ask of the Thus-Gone One.”

source: མཛེས་དགའ་ངས་ཞུ་བ་ལུང་བསྟན་པའི་ཕྱིར་འདི་ལྟར་ཐམས་ཅད་སྐབས་དབྱེ་བར་བྱའོ། །
en: “Sundarānanda, go ahead. For the sake of clarifying your question I will grant an opportunity for all to speak!”

source: ཚིགས་སུ་བཅད་པ།
en: Sundarānanda then spoke these verses:

source: སྟོན་པ་བདེ་བྱིན་མཛད་ལ་ཞུ་བ་ནི། །སྤྱད་པ་སྤྱོད་ཚེ་སུག་ལས་ཅི་བགྱིས་དང་། །བདེ་བའི་ལམ་གྱིས་མྱ་ངན་འདས་རེག་པ། །བདེ་གཤེགས་སྦྱིན་མཛད་དེ་ནི་ལུང་བསྟན་གསོལ། །
en: “Let me ask this of the teacher who grants happiness: When acting, how should one act, So that through the path of happiness one reaches nirvāṇa? Blissful one, with your generosity, please teach this!

source: མ་དྲོས་ཀླུ་ཡི་འཇིག་རྟེན་མགོན་དེ་ལ། །ཞུས་པ་བདེ་བར་གཤེགས་པས་ལུང་བསྟན་པ། །
en: “Here in the nāga realm of Anavatapta we request you, Protector and Blissful One, please teach.

source: དགེ་བའི་ལས་ཀྱི་འབྲས་བུས་ཡིད་འོང་ཞིང་། །གང་གི་བདེ་བས་བདེ་བར་གཤེགས་པ་བསྐྱེད། །
en: As a result of virtuous actions you are beautiful. Through such goodness the Blissful One has come about.

source: སྔོན་གྱི་སྲིད་པར་སྤྱད་པ་སྤྱོད་པའི་ཚེ། །སྐྱེ་བོ་ཐམས་ཅད་བདེ་བས་བདེ་ལྡན་བྱས། །
en: “As you practiced in your previous existences, You joyfully made all beings happy.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །བདེ་བའི་ལམ་གྱིས་མྱ་ངན་འདས་རེག་འགྱུར། །
en: As you did such good deeds, You have reached nirvāṇa through the paths of happiness.

source: སྟོན་པའི་གསུང་གིས་མཛེས་པ་དེ་དགའ་ནས། །
en: “With the words of the teacher, I, Sundara, became happy, And

source: དེ་ཡི་སྐད་ཅིག་ས་སྟེང་པུས་བཙུགས་ཏེ། །
en: immediately I knelt on the ground.

source: གཞལ་མེད་དགའ་བའི་སེམས་ནི་དང་བས་སུ། །འཇིག་རྟེན་སྒྲོན་མ་འདྲེན་ལ་ཕྱག་འཚལ་བྱེད། །
en: With boundless joy I am filled with devotion, And prostrate to our guide, Light of the World.

source: སྟོན་པའི་བློ་ཡིས་མཁས་ལ་ཕྱག་འཚལ་ལོ། །
en: “I prostrate to the teacher’s intelligent learning.

source: འགྲོ་བ་ཀུན་ལས་ངེས་འབྱུང་ཕྱག་འཚལ་ལོ། །
en: I prostrate to you who leaves all existences behind.

source: འཇིགས་མེད་བློ་དག་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: I prostrate to you who has the pure and fearless mind.

source: བདེ་གཤེགས་གཞན་མིན་གསུང་ལ་ཕྱག་འཚལ་ལོ། །
en: I prostrate to the unique words of the Blissful One.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ལྷ་མཛེས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུས་པ།
en: The nāga king Surasundara then spoke to the Blessed One in these melodious verses:

source: འོད་མཛད་སྤྱན་སྡུག་ལེགས་པའི་སྤྱན་མངའ་བ། །བློ་དགེ་ཉོན་མོངས་ཚོགས་ལས་རྣམ་གྲོལ་ཞིང་། །ཡེ་ཤེས་དྲི་མེད་སྤྱོད་ཡུལ་ཁྱོད་ལ་ནི། །སྤྱད་པ་སྤྱོད་ཚེ་རྣམ་ཐར་བླ་མེད་ཞུ། །
en: “Your fine eyes shine with beauty. Your virtuous mind is freed from disturbing emotions. Your experience is one of stainless wisdom. As you carried out activities, how were your perfect lives?

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་སྨན་སླད་དུ། །ཇི་ལྟར་སྤྱད་ན་བྱང་ཆུབ་ཞི་འཚལ་ཞིང་། །མི་མཆོག་དམ་པ་བདག་གི་སྤྱོད་སྦྱོང་བ། །ཡིད་འདས་དེ་དག་བདག་ལ་བཀའ་སྩལ་གསོལ། །
en: “In order to benefit the world and its gods, Whatever you did, it was in search of awakening and peace. Sacred and supreme being, please teach us About your transcendent mind when you engaged in activity.

source: རྒྱལ་བ་དེ་ཡིས་རྡུལ་བཅོམ་དབང་པོ་བསྡམས། །འདོད་པའི་འཆིང་ལས་ཐུགས་ནི་རྣམ་གྲོལ་བའི། །དགོངས་པའི་དེ་ཉིད་སེམས་ཀྱི་རྗེས་འཇུག་པ། །ཐུགས་ཞི་མ་དཀྲུགས་དེས་ནི་ལུང་བསྟན་པ། །
en: “Victorious One, you have overcome all stains and controlled your faculties. Your mind is free from the ties of desire. We are followers of your realized mind. With your peaceful and undisturbed mind, please teach us.

source: མཁས་པས་དགེ་བ་དག་ནི་སྤྱད་པའི་ཕྱིར། །སྲོག་གི་ཕྱིར་ཡང་ཡིད་ནི་མི་ལྡོག་ཅིང་། །རྟག་ཏུ་སྤྱོད་ཚེ་ཉོན་མོངས་མེད་ཡིད་ཀྱིས། །ལུས་དང་ངག་གིས་དགེ་བ་མཉམ་སྤྱོད་པ། །
en: “Learned ones act virtuously, And do not regress from that, even at the cost of their life. Whenever you act, you are free of disturbing emotions, And act virtuously with your body and speech.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །འཁོར་བའི་འགྲོ་ལ་སྤྱོད་པ་རྣམ་དག་སྟེ། །
en: “As you carried out good deeds, You acted purely toward beings in saṃsāra.

source: ཆུ་ཡི་ནང་ནས་པད་མ་སྐྱེ་བ་ལྟར། །གོས་པ་མེད་ཅིང་བྱང་ཆུབ་ཡང་དག་འགྲུབ། །
en: Like a lotus blooming in a lake, You are unstained, your awakening accomplished.

source: བདེ་གཤེགས་གསུང་གིས་ལྷ་ཡི་མཛེས་པ་ཀླུ། །དེ་ནི་དགའ་ཞིང་ལེགས་པར་མགུ་བས་སུ། །དེ་ཡི་སྐད་ཅིག་ས་ལ་པུས་བཙུགས་ཏེ། །
en: “The speech of the Blissful One, Has made the nāga Surasundara happy and joyful. Right now I bow to the ground, And

source: སངས་རྒྱས་རྐང་གཉིས་མཆོག་ལ་ཕྱག་འཚལ་བྱེད། །
en: pay homage to the Buddha, the supreme among men.

source: ཐུབ་པ་འཇིག་རྟེན་གསུམ་ལ་སྨན་མཛད་པ། །བློ་གྲོས་ངེས་པར་ཞི་ལ་ཕྱག་འཚལ་ལོ། །
en: “Sage, you benefit the three worlds. I pay homage to your peaceful intelligence.

source: སྤྱད་པ་སྤྱོད་ཚེ་ཁྱོད་ཀྱི་རྗེས་སློབ་ཅིང་། །བྱང་ཆུབ་མི་གཡོ་ཡིད་ནི་བསྐྱེད་པར་བགྱི། །
en: I will follow the example of your activities, And give rise to the mind that never wavers from awakening.

source: སེམས་ཅན་དོན་དུ་སྤྱད་པ་སྤྱོད་པའི་ཚེ། །ལུས་དང་སྲོག་ནི་དེ་བཞིན་བཏང་ནས་སུ། །སྡུག་བསྔལ་ཐར་བྱེད་སངས་རྒྱས་འགྱུར་བ་དང་། །བྱང་ཆུབ་ཞི་བ་བླ་མེད་ཐོབ་པར་བགྱི། །
en: “When practicing for the welfare of others, I will disregard life and limb. Bringing an end to suffering, I will become a buddha, And attain unsurpassed awakening and peace.”

source: ཀླུ་དེའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་སུ། །རྒྱལ་བ་དགྲ་ལས་རྒྱལ་བ་འཛུམ་མཛད་དེ། །
en: Knowing the thoughts of that nāga, The Victorious One smiled, having conquered all enemies.

source: དེ་ཚེ་ཇི་ལྟར་གང་གཱའི་བྱེ་སྙེད་ཀྱི། །སངས་རྒྱས་མཐའ་ཡས་ཞིང་ནི་འོད་ཀྱིས་ཁྱབ། །
en: At that point as many buddha realms As there are sand grains in the Ganges were bathed in light.

source: བདེ་བར་གཤེགས་པས་འཛུམ་པ་བསྟན་པ་ལ། །ནམ་མཁའི་ལྷས་རིག་ལེགས་སོ་ཞེས་གསོལ་ཏེ། །
en: As the Blissful One smiled, The gods in the sky called out their approval:

source: ཨེ་མའོ་རྒྱལ་བས་རྡུལ་བཅོམ་ལྡན་དབང་པོ་བསྒོམས། །
en: “Amazing! The Victorious One has overcome all stains and mastered the faculties.

source: ཁྱོད་དང་མཉམ་མེད་གོང་ན་ཡོད་མ་ཡིན། །
en: He is unequaled and unexcelled!”

source: སངས་རྒྱས་ཞིང་མང་དག་ནི་རབ་གཡོས་ཤིང་། །འདོད་པའི་ལྷ་ནི་སྡེར་བཅས་ཤིན་ཏུ་རྨོངས། །
en: Many buddha realms shook, And the gods in the desire realm were puzzled.

source: ལྷ་ཚོགས་མང་པོ་བསམ་པ་རབ་དགའ་ཞིང་། །རྒྱལ་བ་དབང་པོ་ཐུབ་ལ་ཕྱག་འཚལ་བྱེད། །
en: Many assemblies of gods were delighted, And paid homage to the Victorious One, the able ruler.

source: སྟོན་པའི་ཉན་ཐོས་རྫུ་འཕྲུལ་ཆེ་བའི་མཆོག །མཽད་གལ་བུ་ཡིས་རྒྱལ་ལ་ཡོངས་ཞུས་པ། །
en: The teacher’s hearer who was supreme in miraculous abilities, Maudgalyāyana, asked the Victorious One,

source: གང་གིས་དཔག་ཏུ་མེད་པའི་འཛུམ་མཛད་པ། །བཅོམ་ལྡན་བདེ་གཤེགས་རྒྱུ་གང་རྐྱེན་གང་ལགས། །
en: “Blessed One, that boundless smile of yours, Blessed Blissful One, what are its causes and circumstances?”

source: མཽད་གལ་བུ་ཡིས་རྒྱལ་ལ་ཉེར་ཞུས་པ། །ཐེ་ཙོམ་གཅོད་མཛད་རྒྱལ་བས་བཀའ་སྩལ་པ། །
en: When Maudgalyāyana asked in this way, The Victorious One replied to clear away doubt:

source: ང་ལ་མཆོད་པ་བྱེད་པའི་ཀླུ་འདི་ནི། །མ་འོངས་པ་ཡི་དུས་ན་སངས་རྒྱས་འགྱུར། །
en: “This nāga who is paying homage to me Will become a buddha in the future.

source: ཇི་སྙེད་ཞིང་འདི་འོད་ཀྱིས་ཁྱབ་པ་དག །དེ་དག་ཐམས་ཅད་རྒྱལ་བའི་ཞིང་གཅིག་འགྱུར། །
en: “All these realms pervaded by light Will become a single realm of that victorious one.

source: དེས་ན་རྒྱལ་བ་འདི་ལྟར་འགྱུར་བ་སྟེ། །འདྲེན་པ་དེའི་མིང་དབང་པོ་རྒྱལ་མཚན་ནོ། །
en: Hence, as he becomes such a victorious one, The name of this guide will be Powerful Victory Banner.

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་མཐའ་ཡས་དག ། དེས་ནི་འགྲོ་སྲིད་ཕ་རོལ་སྒྲོལ་བྱེད་དེ། །
en: “Limitless quintillions of beings Shall be taken across existence by this guide.

source: འདི་ལ་བརྟེན་ནས་ངས་ནི་འཛུམ་པ་བསྟན། །
en: That is why I smiled.

source: མཽད་གལ་བུ་ཁྱོད་དེ་ལྟར་ཤེས་པར་གྱིས། །
en: Maudgalyāyana, you must know this!”

source: ཀླུ་དེ་ལུང་བསྟན་པ་ནི་ཐོས་ནས་སུ། །བླ་ན་མེད་པ་དག་གི་དགའ་བས་ཁྱབ། །
en: When the nāga heard this prophecy He became utterly thrilled.

source: ལུང་བསྟན་ཐོས་ནས་བར་སྣང་འདི་ལས་ནི། །ཏ་ལ་བརྒྱད་ཅུའི་སྲིད་དུ་མངོན་པར་འཕགས། །
en: Hearing this prophecy, He floated upward to a height of eighty palm trees.

source: ཕྱོགས་བཅུ་དག་ན་རྣམ་དག་རྒྱལ་བའི་ཞིང་། །བཟང་ལ་གྲངས་མེད་སངས་རྒྱས་དེ་མཐོང་སྟེ། །
en: Floating in space, he surveyed the pure buddha realms in the ten directions, And beheld countless excellent buddhas.

source: མཐོང་ནས་སངས་རྒྱས་རྐང་གཉིས་མཆོག་དག་ལ། ཚིགས་བཅད་སྣ་ཚོགས་དག་གིས་རྒྱལ་བ་བསྟོད། །
en: Seeing these buddhas, who are supreme among men, He praised the victorious ones in this verse:

source: འགྲོ་བ་ཕན་སྐྱེད་རྒྱལ་བ་དགྲ་ལས་རྒྱལ། །
en: “Victorious ones, you benefit others and have conquered the enemy.

source: དབང་པོ་ཐུལ་ཅིང་མ་ནོར་དེ་བཞིན་གསུང་། །
en: You have controlled faculties and your speech is impeccable.

source: འོད་མཛད་བདེན་གསུང་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, radiant speakers of the truth!

source: བདེ་གཤེགས་ཚིག་རྨོངས་མེད་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute you, blissful ones who speak words without confusion!”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: At that point the nāga king Sāgara addressed the Blessed One in these melodious verses:

source: འཇིགས་སེལ་སྔགས་གྲོལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “I pay homage to you who relieves fear and has liberated speech!

source: སྤྱད་པ་སྤྱོད་ཚེ་སུག་ལས་ཅི་བགྱིས་པས། །འཇིགས་ལས་གྲོལ་དང་འགྲོ་བ་ཐར་བགྱིད་པ། །འཇིགས་སེལ་ལམ་ཞུགས་བདག་ལ་བཀའ་སྩལ་གསོལ། །
en: When engaged in activity, whatever you have done Has been free from fear, so that you liberate others. Please teach me that path that relieves fear!

source: ཇི་ལྟར་འདྲེན་པ་བདག་ཉིད་འཇིགས་གྲོལ་ཞིང་། །སྐྱེ་བོ་འཇིགས་ལས་རབ་ཏུ་གྲོལ་མཛད་པ། །ཁྱོད་ཀྱིས་ལེགས་པར་གསུངས་པའི་བཀའ་ཐོས་ནས། །དེ་བཞིན་ངོམས་མེད་ཡིད་ཀྱིས་སྤྱད་པར་བགྱི། །
en: “Guide, your being is free from fear, And you liberate others from fear as well. When I hear your well-spoken words, I will become insatiable in acting them out.”

source: ཆུ་ཆེན་འཛིན་པ་ཀླུ་ཡི་རྒྱ་མཚོ་དེས། །འགྲོ་ལ་ཕན་ཕྱིར་སྟོན་ལ་ཞུ་བྱེད་པ། །
en: As the nāga Sāgara, the Great Sea, Made this request to the teacher for the good of all,

source: འཇིགས་བཅས་ཞེ་སར་བཅས་ཤིང་དེ་བརྟེན་ནས། །མི་དབང་སྤྱན་སྔར་ཞེས་བཅས་པས་འདུག །
en: He was timid and respectful, As he sat before the lord of men.

source: དེ་ཡི་བསམ་པ་འདྲེན་པས་ཐུགས་ཆུད་ནས། །
en: The Guide, who knew his thoughts,

source: ཇི་ལྟར་སྤྱད་ན་འཇིགས་དང་རྣམ་བྲལ་ཞིང་། །སེམས་ཅན་དག་ཀྱང་འཇིགས་ལས་ཐར་བྱེད་པ། །ཡན་ལག་བརྒྱད་ལྡན་གསུང་གིས་ལུང་བསྟན་ཏོ། །
en: Was fearless in whatever he did. Thus, to free others from fear, He taught in a voice that possesses eight qualities.

source: བྱང་ཆུབ་སྤྱད་པ་རྗེས་སུ་སྤྱོད་བྱ་ཞིང་། །དབྱུག་མཚོན་མེད་པས་འགྲོ་ལ་རབ་ཏུ་སྟོན། །
en: Without any sticks or swords, he taught beings The activities of awakening and what must be done.

source: ཆུ་དང་ཐང་དང་དེ་བཞིན་གཡུལ་འཐབ་པའི། །འཇིགས་ལ་ཡང་དང་ཡང་དུ་འཇིགས་མེད་སྦྱིན། །
en: Again and again he granted them fearlessness From the threats of water, deserts, and warfare.

source: དེ་ཡིས་ལེགས་པའི་ལས་ནི་བྱས་པས་ན། །འཇིགས་པར་མི་འགྲོ་བྱང་ཆུབ་རེག་འགྱུར་ལ། །
en: As he carried out these good deeds, He was fearless and had reached awakening.

source: མཉམ་པར་བཞག་པའི་བྱམས་པའི་སེམས་ཀྱིས་སུ། །ཤིན་ཏུ་མི་བཟད་བདུད་སྟོབས་རབ་སྐྲག་བྱེད། །
en: With a loving mind in composure, He terrified even the most powerful and horrifying demon.

source: སྟོབས་བཅུའི་མཁྱེན་པས་རྒྱ་མཚོ་དེ་དགའ་ནས། །དེ་ཡི་སྐད་ཅིག་ས་ལ་པུས་བཙུགས་ཏེ། །
en: With his knowledge of the ten powers he delighted Sāgara, Who immediately knelt on the ground.

source: འཇིགས་པར་མི་གནས་ཞི་བར་རབ་འདུག་ནས། །བདེ་བར་གཤེགས་ལ་ཐལ་སྦྱར་ཕྱག་འཚལ་བྱེད། །
en: Peaceful and free from fear, He saluted the Blissful One with joined palms:

source: སྲིད་ཀུན་བདག་ལ་མི་གནས་ཕྱག་འཚལ་ལོ། །
en: “I salute the lord of existence!

source: དངང་མེད་འཇིགས་བྲལ་ལྡན་ལ་ཕྱག་འཚལ་ལོ། །
en: I salute the one who is free from anguish and fear!

source: དངང་དང་འཇིགས་ལས་སྐྱེ་བོ་བསྒྲལ་བགྱི་ཞིང་། །དེ་བཞིན་གཤེགས་པ་མི་དངང་བདག་འགྱུར་བགྱི། །
en: I also will liberate beings from anguish and fear. I also will become a thus-gone one, a master free from anguish.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་གསེར་གཙུག་གིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Golden Crown addressed the Blessed One in these melodious verses:

source: དྲང་སྲོང་ཆེན་པོ་སྤྱན་དགེ་དབང་པོ་ཐུལ། །
en: “Great sage, you have virtuous eyes and your senses are controlled.

source: སྲིད་པའི་རྒྱ་མཚོ་རྒལ་ཅིང་ཕ་རོལ་ཕྱིན། །
en: You have crossed the ocean of existence and reached the other shore.

source: སྐམ་ལ་བཞུགས་པ་སྲེད་བསྐམས་གང་ཟག་མཆོག །
en: You have reached dry land and become a perfect being who has dried up craving.

source: འགྲོ་བའི་དོན་ཕྱིར་ཁྱོད་ཞུ་བཀའ་སྩལ་གསོལ། །
en: For the sake of beings, I request you to teach!

source: ཇི་ལྟར་སྤྱད་ན་བདེ་གཤེགས་བདག་སྐྱེ་ཞིང་། །རྒྱལ་བའི་བསྟན་ལ་རབ་ཏུ་གནས་གྱུར་དང་། །
en: “No matter what, I will become a blissful one, And abide by the teaching of the victorious one.

source: བདུད་ཕྲག་སྟོང་དག་གིས་ཀྱང་མི་བསྐྱོད་པ། །
en: Not even a thousand demons shall wear me out.

source: ཀུན་སྤྱད་འདི་དག་བདག་ལ་བཀའ་སྩལ་གསོལ། །
en: Please teach us what must be done!”

source: སངས་རྒྱས་ཚུལ་ལ་མི་གཡོ་རབ་གནས་ཤིང་། །ཀླུ་ཡི་གཙོ་བོས་འདྲེན་ལ་དེ་ཞུས་པ། །
en: The Buddha sat unmoving, As the leaders of the nāgas made such requests of the Guide.

source: ཀླུ་ཡི་བདག་པོ་བསམ་པ་ཐུགས་ཆུད་ནས། །ཉོན་མོངས་ཀུན་སྤངས་དེ་ནི་ལུང་བསྟན་པ། །
en: Knowing the thoughts of the leaders of the nāgas, He taught while his mind had abandoned all affliction:

source: ལྷག་པའི་བསམ་པས་ཆོས་ཀྱི་ངེས་ལྡན་ཞིང་། །ངེས་པ་སྟོང་པའི་ཡུལ་ལ་རབ་ཏུ་གནས། །
en: “With a good motivation one surely comes to possess the Dharma. Certainty must be gained with regard to the empty object.

source: སྲིད་ལས་རྣམ་རྒྱལ་བསྟན་ལ་མི་གཡོ་ཞིང་། །གཞལ་མེད་བྱང་ཆུབ་ལ་ནི་འདུན་པ་བསྐྱེད། །
en: Do not waver from the teaching that is victorious over existence, And aspire to immeasurable awakening!”

source: གསེར་གཙུག་རྫུ་འཕྲུལ་ཆེ་བའི་ཀླུ་དེ་ནི། །སངས་རྒྱས་གསུངས་པ་ཐོས་ནས་ཐེ་ཙོམ་མེད། །
en: When the nāga Golden Crown, who possessed great miraculous abilities, Heard the Buddha’s words, he had no doubt.

source: བྱང་ཆུབ་ཕྱིར་ནི་མི་གཡོ་ཡིད་བསྐྱེད་ཅིང་། །འཇིགས་ཀུན་ཕ་རོལ་ཕྱིན་ལ་མངོན་པར་བསྟོད། །
en: He developed an unflinching resolve for awakening, And praised the one who has transcended all fears:

source: སྲིད་མཚོ་རྒལ་ཅིང་སྐམ་ལ་ཤིན་ཏུ་བཞུགས། །
en: “You have crossed the ocean of existence and arrived at dry land.
